gcc
gcc: fatal error: no input files
compilation terminated.
exit status 1
 gcc -g p2final.c
 gdb ./a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b main
Breakpoint 1 at 0x810: file p2final.c, line 22.
(gdb) r
Starting program: /home/runner/pps-test1-NithinHD/a.out 
warning: Error disabling address space randomization: Operation not permitted
n

Breakpoint 1, main () at p2final.c:22
22    x=input();
(gdb) n
enter a number
n
23    y=input();
(gdb) n
enter a number
24    z=sum (x,y);
(gdb) n
25    output (x,y,z);
(gdb) n
32659 + 32659 = 65318
26    return 0;
(gdb) n
27  }(gdb) n
__libc_start_main (main=0x562593c00808 <main>, argc=1, argv=0x7ffca15cc418, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffca15cc408) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) s
__GI_exit (status=0) at exit.c:139
139 exit.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) l
134 in exit.c
(gdb) Quit
(gdb) 